chrisjoyce911/esp32FOTA/src/esp32FOTA.cpp
/*
   esp32 firmware OTA
   Date: December 2018
   Author: Chris Joyce <https://github.com/chrisjoyce911/esp32FOTA/esp32FOTA>
   Purpose: Perform an OTA update from a bin located on a webserver (HTTP Only)

   Date: 2021-12-21
   Author: Moritz Meintker <https://thinksilicon.de>
   Remarks: Re-written/removed a bunch of functions around HTTPS. The library is
            now URL-agnostic. This means if you provide an https://-URL it will
            use the root_ca.pem (needs to be provided via PROGMEM/SPIFFS/LittleFS or SD)
            to verify the server certificate and then download the ressource through an
            encrypted connection unless you set the allow_insecure_https option.
            Otherwise it will just use plain HTTP which will still offer to sign
            your firmware image.

   Date: 2022-09-12
   Author: tobozo <https://github.com/tobozo>
   Changes:
     - Abstracted away filesystem
     - Refactored some code blocks
     - Added spiffs/littlefs/fatfs updatability
     - Made crypto assets (pub key, rootca) loadable from multiple sources
   Roadmap:
     - Firmware/FlashFS update order (SPIFFS/LittleFS first or last?)
     - Archive support for gz/targz formats
       - firmware.gz + spiffs.gz in manifest
       - bundle.tar.gz [ firmware + filesystem ] in manifest
     - Update from Stream (e.g deported update via SD, http or gzupdater)

*/

#include "esp32FOTA.hpp"

// arduino-esp32 core 2.x => 3.x migration
#if __has_include("md_wrap.h")
  #include "md_wrap.h"
#else
  #include "mbedtls/pk.h"
  #include "mbedtls/md.h"
  #include "mbedtls/md_internal.h"
#endif
// arduino-esp32 core 2.x => 3.x migration
#if !defined SPI_FLASH_SEC_SIZE
  #include "spi_flash_mmap.h"
#endif

#include "esp_ota_ops.h"

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-field-initializers"
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"

static int64_t getHTTPStream( esp32FOTA* fota, int partition );
static int64_t getFileStream( esp32FOTA* fota, int partition );
static int64_t getSerialStream( esp32FOTA* fota, int partition );
static bool WiFiStatusCheck();


SemverClass::SemverClass( const char* version )
{
  assert(version);
  if (semver_parse_version(version, &_ver)) {
      log_w( "Invalid semver string '%s' passed to constructor. Defaulting to 0", version );
      _ver = semver_t{0,0,0};
  }
}

SemverClass::SemverClass( int major, int minor, int patch )
{
    _ver = semver_t{major, minor, patch};
}

semver_t* SemverClass::ver()
{
    return &_ver;

}




// Filesystem helper for signature check and pem validation
// This is abstracted away to allow storage alternatives such
// as PROGMEM, SD, SPIFFS, LittleFS or FatFS

bool CryptoFileAsset::fs_read_file()
{
    File file = fs->open( path );
    // if( file->size() > ESP.getFreeHeap() ) return false;
    if( !file ) {
        log_e( "Failed to open %s for reading", path );
        return false;
    }
    contents = ""; // make sure the output bucket is empty
    len = file.size()+1;
    while( file.available() ) {
        contents.push_back( file.read() );
    }
    file.close();
    return len>0;
}


size_t CryptoFileAsset::size()
{
    if( len > 0 ) { // already stored, no need to access filesystem
        return len;
    }
    if( fs ) { // fetch file contents
        if( ! fs_read_file() ) {
            log_e("Invalid contents!");
            return 0;
        }
    } else {
        log_e("No filesystem was set for %s!", path);
        return 0;
    }
    return len;
}



esp32FOTA::esp32FOTA(){}
esp32FOTA::~esp32FOTA(){}


esp32FOTA::esp32FOTA( FOTAConfig_t cfg )
{
    setConfig( cfg );
}


void esp32FOTA::setString( char **dest, const char* src )
{
    if( !src ) {
      log_e("Can't set string to empty source");
      return;
    }
    if( *dest != nullptr ) free( *dest );
    *dest = (char*)malloc( strlen(src)+1 );
    if( *dest == NULL ) {
      log_e("Unable to allocate %d bytes", strlen(src)+1);
      return;
    }
    //strcpy( dest, src);
    memcpy( *dest, src, strlen(src)+1);
    log_d("Assigned value: %s <= %s", *dest, src );
}



esp32FOTA::esp32FOTA(const char* firmwareType, int firmwareVersion, bool validate, bool allow_insecure_https)
{
    setString( &_cfg.name, firmwareType );
    //_cfg.name      = (char*)firmwareType;
    _cfg.sem       = SemverClass( firmwareVersion );
    _cfg.check_sig = validate;
    _cfg.unsafe    = allow_insecure_https;

    setupCryptoAssets();
    debugSemVer("Current firmware version", _cfg.sem.ver() );
}


esp32FOTA::esp32FOTA(const char* firmwareType, const char* firmwareSemanticVersion, bool validate, bool allow_insecure_https)
{
    setString( &_cfg.name, firmwareType );
    //_cfg.name      = (char*)firmwareType;
    _cfg.check_sig = validate;
    _cfg.unsafe    = allow_insecure_https;
    _cfg.sem       = SemverClass( firmwareSemanticVersion );

    setupCryptoAssets();
    debugSemVer("Current firmware version", _cfg.sem.ver() );
}



void esp32FOTA::setConfig( FOTAConfig_t cfg )
{
    setString( &_cfg.name, cfg.name );
    setString( &_cfg.manifest_url, cfg.manifest_url );

    _cfg.sem           = cfg.sem;
    _cfg.check_sig     = cfg.check_sig;
    _cfg.unsafe        = cfg.unsafe;
    _cfg.use_device_id = cfg.use_device_id;
    _cfg.root_ca       = cfg.root_ca;
    _cfg.pub_key       = cfg.pub_key;
    _cfg.signature_len = cfg.signature_len;
    _cfg.allow_reuse   = cfg.allow_reuse;
    _cfg.use_http10    = cfg.use_http10;
    _cfg.use_bundled_certs = cfg.use_bundled_certs;
}


void esp32FOTA::printConfig( FOTAConfig_t *cfg )
{
  if( cfg == nullptr ) cfg = &_cfg;
  log_d("Name: %s\nManifest URL:%s\nSemantic Version: %d.%d.%d\nCheck Sig: %s\nUnsafe: %s\nUse Device ID: %s\nRootCA: %s\nPubKey: %s\nSignatureLen: %d\nHTTP Keep-Alive:%s\nHTTP 1.0:%s\n",
    cfg->name ? cfg->name : "None",
    cfg->manifest_url ? cfg->manifest_url : "None",
    cfg->sem.ver()->major,
    cfg->sem.ver()->minor,
    cfg->sem.ver()->patch,
    cfg->check_sig ?"true":"false",
    cfg->unsafe ?"true":"false",
    cfg->use_device_id ?"true":"false",
    cfg->root_ca ?"true":"false",
    cfg->pub_key ?"true":"false",
    cfg->signature_len,
    cfg->allow_reuse ? "true":"false",
    cfg->use_http10 ?  "true":"false"
  );
}


