chrisjoyce911/esp32FOTA/src/esp32FOTA.cpp
void esp32FOTA::setSignatureLen( size_t len )
{
    _cfg.signature_len = len;
}


void esp32FOTA::setCertFileSystem( fs::FS *cert_filesystem )
{
    _fs = cert_filesystem;
    setupCryptoAssets();
}


// Used for legacy behaviour when SPIFFS and RootCa/PubKey had default values
// New recommended method is to use setPubKey() and setRootCA() with CryptoMemAsset ot CryptoFileAsset objects.
void esp32FOTA::setupCryptoAssets()
{
    if( _fs ) {
        _cfg.pub_key = (CryptoAsset*)(new CryptoFileAsset( rsa_key_pub_default_path, _fs  ));
        _cfg.root_ca = (CryptoAsset*)(new CryptoFileAsset( root_ca_pem_default_path, _fs  ));
    }
}


/* Enable ESP-IDF bundled certs */
void esp32FOTA::useBundledCerts(bool enable)
{
    _cfg.use_bundled_certs = enable;
    if (enable) {
        _cfg.unsafe = false;     // strict
        _cfg.root_ca = nullptr;  // disable custom CA
    }
}
void esp32FOTA::handle()
{
  if ( execHTTPcheck() ) {
      execOTA();
  }
}


// SHA-Verify the OTA partition after it's been written
// https://techtutorialsx.com/2018/05/10/esp32-arduino-mbed-tls-using-the-sha-256-algorithm/
// https://github.com/ARMmbed/mbedtls/blob/development/programs/pkey/rsa_verify.c
bool esp32FOTA::validate_sig( const esp_partition_t* partition, unsigned char *signature, uint32_t firmware_size )
{
    if( !partition ) {
        log_e( "Could not find update partition!" );
        return false;
    }
    size_t pubkeylen = _cfg.pub_key ? _cfg.pub_key->size() : 0;

    if( pubkeylen <= 1 ) {
        log_e("Public key empty, can't validate!");
        return false;
    }

    const char* pubkeystr = _cfg.pub_key->get();

    if( !pubkeystr ) {
        log_e("Unable to get public key, can't validate!");
        return false;
    }

    log_d("Creating mbedtls context");

    mbedtls_pk_context pk;
    mbedtls_md_context_t rsa;
    mbedtls_pk_init( &pk );

    log_d("Parsing public key");

    int ret;
    if( ( ret = mbedtls_pk_parse_public_key( &pk, (const unsigned char*)pubkeystr, pubkeylen ) ) != 0 ) {
        log_e( "Parsing public key failed\n  ! mbedtls_pk_parse_public_key %d (%d bytes)\n%s", ret, pubkeylen, pubkeystr );
        return false;
    }

    if( !mbedtls_pk_can_do( &pk, MBEDTLS_PK_RSA ) ) {
        log_e( "Public key is not an rsa key -0x%x", -ret );
        return false;
    }

    log_d("Initing mbedtls");

    const mbedtls_md_info_t *mdinfo = mbedtls_md_info_from_type( MBEDTLS_MD_SHA256 );
    mbedtls_md_init( &rsa );
    mbedtls_md_setup( &rsa, mdinfo, 0 );
    mbedtls_md_starts( &rsa );

    int bytestoread = SPI_FLASH_SEC_SIZE;
    int bytesread = 0;
    int size = firmware_size;

    uint8_t *_buffer = (uint8_t*)malloc(SPI_FLASH_SEC_SIZE);
    if(!_buffer){
        log_e( "malloc failed" );
        return false;
    }

    log_d("Parsing content");

    log_v( "Reading partition (%i sectors, sec_size: %i)", size, bytestoread );
    while( bytestoread > 0 ) {
        log_v( "Left: %i (%i)               \r", size, bytestoread );

        if( ESP.partitionRead( partition, bytesread, (uint32_t*)_buffer, bytestoread ) ) {
            // Debug output for the purpose of comparing with file
            for( int i = 0; i < bytestoread; i++ ) {
              if( ( i % 16 ) == 0 ) {
                log_v( "\r\n0x%08x\t", i + bytesread );
              }
              log_v( "%02x ", (uint8_t*)_buffer[i] );
            }

            mbedtls_md_update( &rsa, (uint8_t*)_buffer, bytestoread );

            bytesread = bytesread + bytestoread;
            size = size - bytestoread;

            if( size <= SPI_FLASH_SEC_SIZE ) {
                bytestoread = size;
            }
        } else {
            log_e( "partitionRead failed!" );
            return false;
        }
    }

    free( _buffer );

    unsigned char *hash = (unsigned char*)malloc( mdinfo->size );
    if(!hash){
        log_e( "malloc failed" );
        return false;
    }
    mbedtls_md_finish( &rsa, hash );

    ret = mbedtls_pk_verify( &pk, MBEDTLS_MD_SHA256, hash, mdinfo->size, (unsigned char*)signature, _cfg.signature_len );

    free( hash );
    mbedtls_md_free( &rsa );
    mbedtls_pk_free( &pk );
    if( ret == 0 ) {
        return true;
    }

    // validation failed, overwrite the first few bytes so this partition won't boot!
    log_w( "Validation failed, erasing the invalid partition" );
    ESP.partitionEraseRange( partition, 0, ENCRYPTED_BLOCK_SIZE);

    return false;
}




bool esp32FOTA::setupHTTP( const char* url )
{
    const char* rootcastr = nullptr;
    _http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
    _http.setReuse(_cfg.allow_reuse);
    _http.useHTTP10(_cfg.use_http10);

    log_i("Connecting to: %s", url );

    bool is_https = String(url).startsWith("https");

    if (is_https) {

        bool https_initialized = false;

        /* ================================
           1. Bundled ESP-IDF CA certificate
           ================================ */
#if ESP_ARDUINO_VERSION_MAJOR >= 3
        if (!https_initialized && _cfg.use_bundled_certs) {
            __attribute__((weak)) extern const uint8_t ca_cert_bundle_start[] asm("_binary_ca_cert_bundle_start");
            __attribute__((weak)) extern const uint8_t ca_cert_bundle_end[]   asm("_binary_ca_cert_bundle_end");

            if (ca_cert_bundle_start != nullptr && ca_cert_bundle_end != nullptr) {
                size_t bundle_size = ca_cert_bundle_end - ca_cert_bundle_start;
                log_i("Using built-in ESP-IDF certificate bundle (%u bytes)", bundle_size);

                _client.setCACertBundle(ca_cert_bundle_start, bundle_size);
                _http.begin(_client, url);
                https_initialized = true;
            } else {
                log_w("Bundled certs requested, but CA bundle not linked. Falling back.");
            }
        }
#endif

        /* ================================
           2. Custom root CA certificate
           ================================ */
        if (!https_initialized && !_cfg.unsafe && _cfg.root_ca) {
            if (_cfg.root_ca->size() == 0) {
                log_e("Strict HTTPS but empty RootCA provided");
                return false;
            }
            rootcastr = _cfg.root_ca->get();
            if (!rootcastr) {
                log_e("Strict HTTPS but failed to get RootCA contents");
                return false;
            }
            log_i("Using custom RootCA for TLS");
            _client.setCACert(rootcastr);
            _http.begin(_client, url);
            https_initialized = true;
        }

        /* ================================
           3. Insecure HTTPS
           ================================ */
        if (!https_initialized && _cfg.unsafe) {
            log_w("Insecure HTTPS enabled");
            _client.setInsecure();
            _http.begin(_client, url);
            https_initialized = true;
        }

        /* ================================
           4. No CA available (strict)
           ================================ */
        if (!https_initialized) {
            log_e("Strict HTTPS enabled but no CA source available (neither bundled nor custom)");
            return false;
        }

    } else {
        _http.begin(url);
    }

    if( extraHTTPHeaders.size() > 0 ) {
        // add custom headers provided by user e.g. _http.addHeader("Authorization", "Basic " + auth)
        for( const auto &header : extraHTTPHeaders ) {
            _http.addHeader(header.first, header.second);
        }
    }

    // TODO: add more watched headers e.g. Authorization: Signature keyId="rsa-key-1",algorithm="rsa-sha256",signature="Base64(RSA-SHA256(signing string))"
    const char* get_headers[] = { "Content-Length", "Content-type", "Accept-Ranges" };
    _http.collectHeaders( get_headers, sizeof(get_headers)/sizeof(const char*) );

