chrisjoyce911/esp32FOTA/src/esp32FOTA.cpp
    return true;
}




void esp32FOTA::setupStream()
{
    if(!getStream) {
        switch( _stream_type ) {
            case FOTA_FILE_STREAM:
                setStreamGetter( getFileStream );
            break;
            case FOTA_SERIAL_STREAM:
                setStreamGetter( getSerialStream );
            break;
            case  FOTA_HTTP_STREAM:
            default:
                setStreamGetter( getHTTPStream );
            break;
        }
    }

    if( !isConnected ) {
        setStatusChecker( WiFiStatusCheck );
    }
}


void esp32FOTA::stopStream()
{
    if( endStream ) { // user function provided via ::setStreamEnder( fn )
        endStream( this );
        return;
    }

    // no user function provided, apply default behaviour
    switch( _stream_type ) {
        case FOTA_FILE_STREAM:
            if( _file ) _file.close();
        break;
        case  FOTA_HTTP_STREAM:
            _http.end();
        break;
        case FOTA_SERIAL_STREAM:
        default:
        break;
    }

}



// OTA Logic
bool esp32FOTA::execOTA()
{
    setupStream();

    if( !_flashFileSystemUrl.isEmpty() ) { // a data partition was specified in the json manifest, handle the spiffs partition first
        if( _fs ) { // Possible risk of overwriting certs and signatures, cancel flashing!
            log_e("Cowardly refusing to overwrite U_SPIFFS with %s. Use setCertFileSystem(nullptr) along with setPubKey()/setCAPem() to enable this feature.", _flashFileSystemUrl);
            return false;
        } else {
            log_i("Will check if U_SPIFFS needs updating");
            if( !execOTA( U_SPIFFS, false ) ) return false;
        }
    } else {
        log_i("This update is for U_FLASH only");
    }
    // handle the application partition and restart on success
    bool ret = execOTA( U_FLASH, true );

    stopStream();

    return ret;
}

// OTA Logic
bool esp32FOTA::execSPIFFSOTA()
{
	bool ret = false;
    setupStream();

    if( !_flashFileSystemUrl.isEmpty() ) { // a data partition was specified in the json manifest, handle the spiffs partition first
        if( _fs ) { // Possible risk of overwriting certs and signatures, cancel flashing!
            log_e("Cowardly refusing to overwrite U_SPIFFS with %s. Use setCertFileSystem(nullptr) along with setPubKey()/setCAPem() to enable this feature.", _flashFileSystemUrl);
            return false;
        } else {
            log_i("Will check if U_SPIFFS needs updating");
            ret = execOTA( U_SPIFFS, false );
        }
    } else {
        log_i("This update is for U_FLASH only");
    }
    stopStream();
    return ret;
}


bool esp32FOTA::execOTA( int partition, bool restart_after )
{
    // health checks
    if( partition != U_SPIFFS && partition != U_FLASH ) {
        log_e("Bad partition number: %i or empty URL, aborting", partition);
        return false;
    }
    if( partition == U_SPIFFS && _flashFileSystemUrl.isEmpty() ) {
        log_i("[SKIP] No spiffs/littlefs/fatfs partition was specified");
        return true; // data partition is optional, so not an error
    }
    if ( partition == U_FLASH && _firmwareUrl.isEmpty() ) {
        log_e("No firmware URL, aborting");
        return false; // app partition is mandatory
    }

    // call getHTTPStream
    int64_t updateSize = getStream( this, partition );

    if( updateSize<=0 || _stream == nullptr ) {
        log_e("HTTP Error");
        return false;
    }

    // some network streams (e.g. Ethernet) can be laggy and need to 'breathe'
    if( ! _stream->available() ) {
        uint32_t timeout = millis() + _stream_timeout;
        while( ! _stream->available() ) {
            if( millis()>timeout ) {
                log_e("Stream timed out");
                return false;
            }
            vTaskDelay(1);
        }
    }

    mode_z = F_isZlibStream();

    log_d("compression: %s", mode_z ? "enabled" : "disabled" );

    if( _cfg.check_sig ) {
        if( mode_z ) {
            log_e("Compressed && signed image is not (yet) supported");
            return false;
        }
        if( updateSize == UPDATE_SIZE_UNKNOWN || updateSize <= _cfg.signature_len ) {
            log_e("Malformed signature+fw combo");
            return false;
        }
        updateSize -= _cfg.signature_len;
    }

    // If using compression, the size is implicitely unknown
    size_t fwsize = mode_z ? UPDATE_SIZE_UNKNOWN : updateSize;       // fw_size is unknown if we have a compressed image

    bool canBegin = F_canBegin();

    if( !canBegin ) {
        log_e("Not enough space to begin OTA, partition size mismatch?");
        F_abort();
        if( onUpdateBeginFail ) onUpdateBeginFail( partition );
        return false;
    }

    if( onOTAProgress ) {
        F_Update.onProgress( onOTAProgress );
    } else {
        F_Update.onProgress( [](size_t progress, size_t size) {
            if( progress >= size ) Serial.println();
            else if( progress > 0) Serial.print(".");
        });
    }

    unsigned char* signature = new unsigned char[_cfg.signature_len];
    if( _cfg.check_sig ) {
        _stream->readBytes( signature, _cfg.signature_len );
    }

    log_i("Begin %s OTA. This may take 2 - 5 mins to complete. Things might be quiet for a while.. Patience!", partition==U_FLASH?"Firmware":"Filesystem");

    // Some activity may appear in the Serial monitor during the update (depends on Update.onProgress)
    size_t written = F_writeStream();

    if (fwsize == UPDATE_SIZE_UNKNOWN)      // match compressed fw size to responce length
        fwsize = updateSize;

    if ( written == fwsize ) {
        log_d("Written : %d successfully", written);
        updateSize = written; // flatten value to prevent overflow when checking signature
    } else {
        log_e("Written only : %d/%d Premature end of stream?", written, updateSize);
        F_abort();
        delete[] signature;
        return false;
    }

    if (!F_UpdateEnd()) {
        log_e("An Update Error Occurred. Error #: %d", F_Update.getError());
        delete[] signature;
        return false;
    }

    if( onUpdateEnd ) onUpdateEnd( partition );

    if( _cfg.check_sig ) { // check signature

        log_i("Checking partition %d to validate", partition);

