chrisjoyce911/esp32FOTA/src/esp32FOTA.cpp
    if (semver_compare(*_payload_sem.ver(), *_cfg.sem.ver()) == 1) {
        return true;
    }

    return false;
}




bool esp32FOTA::execHTTPcheck()
{
    String useURL = String( _cfg.manifest_url );

    if( useURL.isEmpty() ) {
      log_e("No manifest_url provided in config, aborting!");
      return false;
    }

    // being deprecated, soon unsupported!
    // if( useURL.isEmpty() && !checkURL.isEmpty() ) {
    //     log_w("checkURL will soon be unsupported, use FOTAConfig_t::manifest_url instead!!");
    //     useURL = checkURL;
    // }

    // // being deprecated, soon unsupported!
    // if( useDeviceID ) {
    //     log_w("useDeviceID will soon be unsupported, use FOTAConfig_t::use_device_id instead!!");
    //     _cfg.use_device_id = useDeviceID;
    // }

    if (_cfg.use_device_id) {
        // URL may already have GET values
        String argseparator = (useURL.indexOf('?') != -1 ) ? "&" : "?";
        useURL += argseparator + "id=" + getDeviceID();
    }

    if ( isConnected && !isConnected() ) { // Check the current connection status
        log_i("Connection check requested but network not ready - skipping");
        return false;  // WiFi not connected
    }

    log_i("Getting HTTP: %s", useURL.c_str());

    if(! setupHTTP( useURL.c_str() ) ) {
      log_e("Unable to setup http, aborting!");
      return false;
    }

    int httpCode = _http.GET();  //Make the request

    // only handle 200/301, fail on everything else
    if( httpCode != HTTP_CODE_OK && httpCode != HTTP_CODE_MOVED_PERMANENTLY ) {
        // This error may be a false positive or a consequence of the network being disconnected.
        // Since the network is controlled from outside this class, only significant error messages are reported.
        if( httpCode > 0 ) {
            log_e("Error on HTTP request (httpCode=%i)", httpCode);
        } else {
            log_d("Unknown HTTP response");
        }
        _http.end();
        return false;
    }

    // TODO: use payload.length() to speculate on JSONResult buffer size
    #define JSON_FW_BUFF_SIZE 2048
    DynamicJsonDocument JSONResult( JSON_FW_BUFF_SIZE );
    DeserializationError err = deserializeJson( JSONResult, _http.getStream() );

    if (err) {  // Check for errors in parsing, or JSON length may exceed buffer size
        log_e("JSON Parsing failed (%s, in=%d bytes, buff=%d bytes):", err.c_str(), _http.getSize(), JSON_FW_BUFF_SIZE );
        return false;
    }

    _http.end();  // We're done with HTTP - free the resources

    if (JSONResult.is<JsonArray>()) {
        // Although improbable given the size on JSONResult buffer, we already received an array of multiple firmware types and/or versions
        JsonArray arr = JSONResult.as<JsonArray>();
        for (JsonVariant JSONDocument : arr) {
            if(checkJSONManifest(JSONDocument)) {
                // TODO: filter "highest vs next" version number for JSON with only one firmware type but several version numbers
                return true;
            }
        }
    } else if (JSONResult.is<JsonObject>()) {
        if(checkJSONManifest(JSONResult.as<JsonVariant>()))
            return true;
    }

    return false; // We didn't get a hit against the above, return false
}


String esp32FOTA::getDeviceID()
{
    char deviceid[21];
    uint64_t chipid;
    chipid = ESP.getEfuseMac();
    sprintf(deviceid, "%" PRIu64, chipid);
    String thisID(deviceid);
    return thisID;
}


// Force a firmware update regardless on current version
bool esp32FOTA::forceUpdate(const char* firmwareURL, bool validate )
{
    _firmwareUrl = firmwareURL;
    _cfg.check_sig = validate;
    return execOTA();
}

// Force a firmware update regardless on current version
bool esp32FOTA::forceUpdateSPIFFS(const char* firmwareURL, bool validate )
{
    _firmwareUrl = firmwareURL;
    _flashFileSystemUrl = firmwareURL;
    _cfg.check_sig = validate;
    return execSPIFFSOTA();
}


bool esp32FOTA::forceUpdate(const char* firmwareHost, uint16_t firmwarePort, const char*  firmwarePath, bool validate )
{
    static String firmwareURL("http");
    if ( firmwarePort == 443 || firmwarePort == 4433 ) firmwareURL += "s";
    firmwareURL += "://";
    firmwareURL += String(firmwareHost);
    firmwareURL += ":";
    firmwareURL += String(firmwarePort);
    firmwareURL += firmwarePath;
    return forceUpdate( firmwareURL.c_str(), validate );
}


bool esp32FOTA::forceUpdate(bool validate )
{
    // Forces an update from a manifest, ignoring the version check
    if(!execHTTPcheck()) {
        if (!_firmwareUrl) {
            // execHTTPcheck returns false when the manifest is malformed or when the version isn't
            // an upgrade. If _firmwareUrl isn't set we can't force an upgrade.
            log_e("forceUpdate called, but unable to get _firmwareUrl from manifest via execHTTPcheck.");
            return false;
        }
    }
    _cfg.check_sig = validate;
    return execOTA();
}


/**
 * This function return the new version of new firmware
 */
int esp32FOTA::getPayloadVersion()
{
    log_w( "This function only returns the MAJOR version. For complete depth use getPayloadVersion(char *)." );
    return _payload_sem.ver()->major;
}


void esp32FOTA::getPayloadVersion(char * version_string)
{
    semver_render( _payload_sem.ver(), version_string );
}


void esp32FOTA::debugSemVer( const char* label, semver_t* version )
{
   char version_no[256] = {'\0'};
   semver_render( version, version_no );
   log_i("%s: %s", label, version_no );
}






static int64_t getHTTPStream( esp32FOTA* fota, int partition )
{

    const char* url = partition==U_SPIFFS ? fota->getFlashFS_URL() : fota->getFirmwareURL();

    log_d("Opening item %s\n", url );

    if(! fota->setupHTTP( url ) ) { // certs
        log_e("unable to setup http, aborting!");
        return -1;
    }

    int64_t updateSize = 0;
    int httpCode = fota->getHTTPCLient()->GET();
    String contentType;

    fota->setFotaStream( nullptr );

    if( httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY ) {
        updateSize = fota->getHTTPCLient()->getSize();
        contentType = fota->getHTTPCLient()->header( "Content-type" );
        String acceptRange = fota->getHTTPCLient()->header( "Accept-Ranges" );
        if( acceptRange == "bytes" ) {
            log_v("This server supports resume!" );
        } else {
            log_v("This server does not support resume!" );
        }
    } else {
        switch( httpCode ) {
            // 1xx = Hold on
            // 2xx = Here you go
            // 3xx = Go away
            // 4xx = You fucked up
            // 5xx = I fucked up

            case 204: log_e("Status: 204 (No contents), "); break;
            case 401: log_e("Status: 401 (Unauthorized), check setExtraHTTPHeader() values"); break;
            case 403: log_e("Status: 403 (Forbidden), check path on webserver?"); break;
            case 404: log_e("Status: 404 (Not Found), also a palindrom, check path in manifest?"); break;
            case 418: log_e("Status: 418 (I'm a teapot), Brit alert!"); break;
            case 429: log_e("Status: 429 (Too many requests), throttle things down?"); break;
            case 500: log_e("Status: 500 (Internal Server Error), you broke the webs!"); break;
            default:
                // This error may be a false positive or a consequence of the network being disconnected.
                // Since the network is controlled from outside this class, only significant error messages are reported.
                if( httpCode > 0 ) {
                    log_e("Server responded with HTTP Status '%i'. Please check your setup", httpCode );
                } else {
                    log_d("Unknown HTTP response");
                }
            break;
        }

        return -1;
    }

    // TODO: Not all streams respond with a content length.
    // TODO: Set updateSize to UPDATE_SIZE_UNKNOWN when content type is valid.

    // check updateSize and content type
    if( updateSize<=0 ) {
        log_e("There was no content in the http response: (length: %" PRId64 ", contentType: %s)\n", updateSize, contentType.c_str());
        return -1;
    }

    log_d("updateSize : %" PRId64 ", contentType: %s", updateSize, contentType.c_str());

    fota->setFotaStream( fota->getHTTPCLient()->getStreamPtr() );

    return updateSize;
}



static int64_t getFileStream( esp32FOTA* fota, int partition)
{
    fs::FS* fs = fota->getFotaFS();

    if(!fs ) {
      log_e("No filesystem defined, use ::setCertFileSystem( &SD ) ");
      return -1;
    }

    const char* path = partition==U_SPIFFS ? fota->getFlashFS_URL() : fota->getFirmwareURL();
    log_d("Opening item %s\n", path );

    fs::File* file = (fs::File*)fota->getFotaStreamPtr();
    *file = fs->open( path );

    if(! file ) {
        log_e("unable to access filesystem, aborting!");
        return -1;
    }

    int64_t updateSize = file->size();

    // check updateSize and content type
    if( !updateSize ) {
        log_e("Empty file");
        file->close();
        fota->setFotaStream( nullptr );
        return -1;
    }

    log_d("updateSize : %i", updateSize);

    return updateSize;
}



static int64_t getSerialStream( esp32FOTA* fota, int partition)
{
    return -1;
}



static bool WiFiStatusCheck()
{
    return (WiFi.status() == WL_CONNECTED);
}

/*
static bool EthernetStatusCheck()
{
    return eth_connected;
}
*/



#pragma GCC diagnostic pop
